tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

## Put this on top.
brew 'zsh'

## GNU File, Shell and Text Utils https://www.gnu.org/software/coreutils
brew 'coreutils'

### ======================== DEVELOPMENT TOOLS =================================

## Do I need to explain?
brew 'git'
brew 'git-flow'
brew 'groovy'

brew 'ruby'
brew 'jruby'
brew 'python3'

brew 'maven'

## Heroku Command line
brew 'heroku'

## Search tool like grep, but optimized for programmers
## http://beyondgrep.com/
brew 'ack'

brew 'mongodb', restart_service: true
brew 'mysql', restart_service: true
brew 'sqlite'

## Manage multiple Node.js versions
## https://github.com/creationix/nvm
brew 'nvm'

## Ruby version manager
## https://github.com/rbenv/rbenv#readme
brew 'rbenv'

### ======================== MEDIA TOOLS =======================================

## Swiss-army knife of markup format conversion
## https://pandoc.org/
brew 'pandoc'

### ======================== MISC TOOLS ========================================

brew 'wget'

## CLI tool for quick access to files and directories
## https://github.com/clvv/fasd
brew 'fasd'

## Download with resuming and segmented downloading
## https://aria2.github.io/
brew 'aria2'

## Password Manager https://www.passwordstore.org/
brew 'pass'

## Lightweight and flexible command-line JSON processor
## https://stedolan.github.io/jq/
brew 'jq'

## Swiss Army Knife for macOS
## https://github.com/rgcr/m-cli
brew 'm-cli'

## Display directories as trees (with optional color/HTML output)
## http://mama.indstate.edu/users/ice/tree/
brew 'tree'

## Download YouTube videos from the command-line
## https://rg3.github.io/youtube-dl/
brew 'youtube-dl'

## Fun but really useless stuff.
brew 'cowsay'
brew 'fortune'
