# Tap some stuff!!!!
tap 'caskroom/cask'
tap 'homebrew/brewdler'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'josegonzalez/php'

# Basic Utils
brew 'ack'
brew 'autoconf'
brew 'brew-cask'
brew 'coreutils'
brew 'findutils'
brew 'freetype'
brew 'gettext'
brew 'grep'
brew 'icu4c'
brew 'libffi'
brew 'libpng'
brew 'libtool'
brew 'libyaml'
brew 'lynx'
brew 'openssl'
brew 'pcre'
brew 'pigz'
brew 'pkg-config'
brew 'rbenv'
brew 'readline'
brew 'rename'
brew 'rhino'
brew 'ruby-build'
brew 'tree'
brew 'unixodbc'
brew 'wget'
brew 'xz'
brew 'maven'
brew 'cmake'

# Customized stuff for Kurogo
brew 'php55', args: ['with-fpm']
brew 'php55-apcu'
brew 'php55-mcrypt'
brew 'homebrew/apache/httpd24'
brew 'homebrew/php/composer'
brew 'php55-redis'

# Media
brew 'imagemagick'
brew 'jpeg'
brew 'lame'
brew 'webkit2png'
brew 'zlib'
brew 'zopfli'

brew 'fasd'
brew 'autojump'
brew 'the_silver_searcher'

# Version Control
brew 'git'
brew 'subversion'

# Persistence Stuff
brew 'mongodb'
brew 'mysql'
brew 'sqlite'
brew 'redis'


# Fun Stuff
brew 'fortune'
brew 'cowsay'


cask 'dropbox'
cask 'virtualbox'
